Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Coverage for tests not using @QuarkusTest
ja_jp: QuarkusTestを使用していないテストのカバレッジ

source: Craft some code and https://github.com/quarkusio/quarkus/pulls[push a PR].
ja_jp: コードを作成し、 https://github.com/quarkusio/quarkus/pulls[プルリクエスト] を送信

source: Create a default Keycloak Admin Client which can perform Keycloak `master` realm administration tasks as an `admin-cli` client, such as adding new realms, clients and users.
ja_jp: 新しいレルム、クライアント、ユーザーの追加など、 `admin-cli` クライアントとしてKeycloak `master` レルム管理タスクを実行できるデフォルトのKeycloak Admin Clientを作成します。

source: Create App
ja_jp: アプリの作成

source: Create JwtClaimsBuilder and set the claims
ja_jp: JwtClaimsBuilder の作成とクレームの設定

source: Create OIDC configuration at request time
ja_jp: リクエスト時の OIDC 設定の作成

source: Create OIDC configuration at start-up
ja_jp: 起動時の OIDC 設定の作成

source: Create OIDC tenant 'tenant-one'.
ja_jp: OIDC テナント tenant-one を作成します。

source: Create OIDC tenant 'tenant-two'.
ja_jp: OIDC テナント tenant-two を作成します。

source: Create Quarkus content in AsciiDoc
ja_jp: QuarkusのコンテンツをAsciiDocで作成

source: Create SMTP credentials if needed
ja_jp: 必要に応じてSMTP認証情報を作成します

source: Create Vert.x router.
ja_jp: Vert.x ルーターを作成します。

source: Create `ApiEchoService` service class:
ja_jp: `ApiEchoService` サービスクラスを作成します。

source: Create `org.acme.microprofile.health.DatabaseConnectionHealthCheck` class:
ja_jp: `org.acme.microprofile.health.DatabaseConnectionHealthCheck` クラスを作成します:

source: Create `org.acme.microprofile.health.StartupHealthCheck` class:
ja_jp: `org.acme.microprofile.health.SimpleHealthCheck` クラスを作成:

source: Create a "search scope" targeting all indexed entity types that extend `Object` -- that is, every single indexed entity types (`Author` and `Book`).
ja_jp: `Object` を拡張するすべてのインデックス付きエンティティータイプ、つまりすべてのインデックス付きエンティティータイプ (`Author` および `Book`) をターゲットとする "search scope" を作成します。

source: Create a <<codestart-yml>> file in `runtime/src/main/codestarts/quarkus/aloha-codestart`:
ja_jp: <<codestart-yml>> `runtime/src/main/codestarts/quarkus/aloha-codestart` でのファイルの作成:

source: Create a Git release at the chosen repository, tagging it.
ja_jp: 選択したリポジトリーに Git リリースを作成し、タグを付けます。

source: Create a Hibernate Search session, which allows executing operations on the indexes.
ja_jp: インデックスに対する操作を実行できる Hibernate Search セッションを作成します。

source: Create a Homebrew formula, publishing to pass:[https://gitcom.com/aamiray/homebrew-tap].
ja_jp: Homebrew 式を作成し、pass:https://gitcom.com/aamiray/homebrew-tap に公開します。

source: Create a Homebrew formula, publishing to pass:[https://github.com/aalmiray/homebrew-tap].
ja_jp: Homebrew 公式を作成し、 pass:[https://github.com/aalmiray/homebrew-tap] に公開します。

source: Create a KeyStore
ja_jp: KeyStoreの作成

source: Create a Maven project
ja_jp: Maven プロジェクトの作成

source: Create a Panache Entity
ja_jp: Panache エンティティの作成

source: Create a Quarkus Test using the test resource created above:
ja_jp: 上記で作成したテストリソースを使用して Quarkus テストを作成します。

source: Create a Quarkus application
ja_jp: Quarkus アプリケーションの作成

source: Create a Quarkus application in JVM mode by using the quick start example
ja_jp: クイックスタートの例を使用して、JVM モードの Quarkus アプリケーションを作成します。

source: Create a Quarkus project importing the quarkus-rest-client and quarkus-rest extensions using your favorite approach:
ja_jp: quarkus-rest-clientとquarkus-rest extensionsをインポートして、Quarkusプロジェクトを作成します：

source: Create a Quarkus project importing the quarkus-rest-client, quarkus-rest, and quarkus-smallrye-stork extensions using your favorite approach:
ja_jp: quarkus-rest-client、quarkus-rest、quarkus-smallrye-storkの各エクステンションをインポートして、Quarkusプロジェクトを作成します：

source: Create a Quarkus project importing the quarkus-rest-client-reactive and quarkus-resteasy-reactive extensions using your favorite approach:
ja_jp: quarkus-rest-client-reactiveおよびquarkus-resteasy-reactiveエクステンションをインポートして、好きなアプローチでQuarkusプロジェクトを作成します。

source: Create a REST client:
ja_jp: REST クライアントを作成します。

source: Create a REST endpoint
ja_jp: RESTエンドポイントの作成

source: Create a REST endpoint in `src/main/java/org/acme/security/jwt/TokenSecuredResource.java` with the following content:
ja_jp: RESTエンドポイントを `src/main/java/org/acme/security/jwt/TokenSecuredResource.java` に以下の内容で作成します。

source: Create a REST endpoint to populate the list. Even numbers are added to the list, and odd numbers remove an element from the list.
ja_jp: REST エンドポイントを作成して、リストに要素を追加します。偶数はリストに追加され、奇数はリストから要素を削除します。

source: Create a REST resource
ja_jp: RESTリソースの作成

source: Create a Service monitor in our project
ja_jp: プロジェクトにサービスモニターを作成

source: Create a UTF-8 encoded file located in the `src/main/resources/messages` directory of an application archive; e.g. `msg_de.properties`.
ja_jp: アプリケーションアーカイブの `src/main/resources/messages` ディレクトリーにある UTF-8 エンコードファイルを作成します (例: `msg_de.properties`)。

source: Create a `@QuarkusTest` using the test resource created above:
ja_jp: 上記で作成したテストリソースを使用して `@QuarkusTest` を作成します。

source: Create a `AlohaCodestartTest` in the `integration-tests`:
ja_jp: `integration-tests` に `AlohaCodestartTest` を作成します。

source: Create a `Fruit` instance from the `Row` if an entity was found.
ja_jp: エンティティーが見つかった場合は、 `Row` から `Fruit` インスタンスを作成します。

source: Create a `Gauge` named `jvm.memory.total` with a description and unit.
ja_jp: 説明と単位を指定して、名前に `jvm.memory.total` を指定して `Gauge` を作成します。

source: Create a `IncomingKafkaRecordBatch` with a single record.
ja_jp: 単一のレコードを含む `IncomingKafkaRecordBatch` を作成します。

source: Create a `LongCounter` named `hello-metrics` with a description and unit.
ja_jp: 説明と単位を指定して、 `hello-metrics` という名前の `LongCounter` を作成します。

source: Create a `LongHistogram` named `hello.roll.dice` with a description and unit.
ja_jp: 説明と単位を指定して、名前が `hello.roll.dice` の `LongHistogram` を作成します。

source: Create a `Mail` object by configuring the _to_ recipient, the subject and body
ja_jp: _to_ (受信者)、件名、本文を設定して、 `Mail` オブジェクトを作成

source: Create a `Timer.Sample` that tracks the start time
ja_jp: 開始時間を追跡する Timer.Sample を作成します

source: Create a `Tuple` to hold the prepared query parameters.
ja_jp: プリペアドクエリーパラメーターを保持するための `Tuple` を作成します。

source: Create a `docker-compose.yaml` file at the root of the project with the following content:
ja_jp: プロジェクトのルートに、次の内容の `docker-compose.yaml` ファイルを作成します。

source: Create a `maven2(proxy)` repository
ja_jp: `maven2(proxy)` リポジトリの作成

source: Create a `security-jwt-quickstart/src/main/resources/application.properties` with the following content:
ja_jp: 次の内容で `security-jwt-quickstart/src/main/resources/application.properties` を作成します。

source: Create a `src/main/java/org/acme/jfr/JfrResource.java` file with the following content:
ja_jp: 次の内容を含む `src/main/java/org/acme/jfr/JfrResource.java` ファイルを作成します。

source: Create a `src/main/java/org/acme/opentelemetry/MetricResource.java` file with the following content:
ja_jp: `src/main/java/org/acme/opentelemetry/MetricResource.java` のファイルを開くと、以下の内容が表示されます。

source: Create a `src/main/java/org/acme/opentelemetry/TracedResource.java` file with the following content:
ja_jp: `src/main/java/org/acme/opentelemetry/TracedResource.java` のファイルを開くと、以下の内容が表示されます。

source: Create a `src/main/java/org/acme/rest/client/Extension.java` file and set the following content:
ja_jp: `src/main/java/org/acme/rest/client/Extension.java` ファイルを作成し、以下の内容を設定します。

source: Create a `src/main/java/org/acme/rest/client/multipart/MultipartBody.java` file and set the following content:
ja_jp: `src/main/java/org/acme/rest/client/multipart/MultipartBody.java` ファイルを作成し、以下の内容を設定します。

source: Create a base container image
ja_jp: ベースとなるコンテナーイメージを作成する

source: Create a custom `session_expired` cookie valid for 5 seconds which joins the encrypted token and a tenant id using a "|" separator. Recording a tenant id in a custom cookie can help to generate correct session expired pages in a multi-tenant OIDC setup.
ja_jp: 暗号化されたトークンとテナント ID を区切り文字 "|" を使用して結合し、5 秒間有効なカスタム `session_expired` Cookie を作成します。カスタム Cookie にテナント ID を記録すると、マルチテナント OIDC セットアップで正しいセッション期限切れページを生成する場合に役立ちます。

source: Create a custom `session_expired` cookie valid for 5 seconds, which joins the encrypted token and a tenant ID using a "|" separator. Recording a tenant ID in a custom cookie can help generate the correct session-expired pages in a multi-tenant OIDC setup.
ja_jp: 暗号化されたトークンとテナント ID を区切り文字 "|" を使用して結合し、5 秒間有効なカスタム `session_expired` Cookie を作成します。カスタム Cookie にテナント ID を記録すると、マルチテナント OIDC セットアップで正しいセッション期限切れページを生成する場合に役立ちます。

source: Create a customized MeterRegistry
ja_jp: カスタマイズされたMeterRegistryの作成

source: Create a directory called `.s2i` at the same level as the `pom.xml` file.
ja_jp: `pom.xml` ファイルと同じ階層に `.s2i` というディレクトリを作成します。

source: Create a distribution summary
ja_jp: ディストリビューションサマリーを作成する

source: Create a file called `environment` in the `.s2i` directory and add the following content:
ja_jp: `.s2i` ディレクトリに `environment` というファイルを作成し、以下の内容を追加します：

source: Create a file named `kubernetes-setup.yml` with the content above at the root of the project and run the following commands to deploy all the resources in the Kubernetes cluster. Don't forget to create a dedicated namespace:
ja_jp: プロジェクトのルートに上記の内容で `kubernetes-setup.yml` というファイルを作成し、以下のコマンドを実行して Kubernetes クラスターにすべてのリソースをデプロイしてください。専用の名前空間を作成することを忘れないでください。

source: Create a fitting executor. In this case, a new thread is created per scheduled task and stopped once the task finishes.
ja_jp: フィットするエクゼキューターを作成します。この場合、スケジュールされたタスクごとに新しいスレッドが作成され、タスクが終了すると停止します。

source: Create a https://api.slack.com/authentication/sign-in-with-slack#setup[Slack application]:
ja_jp: https://api.slack.com/authentication/sign-in-with-slack#setup[Slack アプリケーション] を作成します。

source: Create a https://dev.twitch.tv/console/apps[Twitch application]:
ja_jp: link:https://dev.twitch.tv/console/apps[Twitchアプリケーション] を作成する：

source: Create a https://developer.linkedin.com/[LinkedIn application]:
ja_jp: https://developer.linkedin.com/[LinkedIn アプリケーション] を作成します。

source: Create a https://developer.spotify.com/documentation/general/guides/authorization/app-settings/[Spotify application]:
ja_jp: https://developer.spotify.com/documentation/general/guides/authorization/app-settings/[Spotify application] を作成します。

source: Create a https://discord.com/developers/applications[Discord application]:
ja_jp: https://discord.com/developers/applications[Discord アプリケーション] を作成します。

source: Create a https://joinmastodon.org/[Mastodon account]. You must https://joinmastodon.org/servers[pick a server], for example, `mastodon.social`. Select a `Development` option in your account and register an application, for example:
ja_jp: link:https://joinmastodon.org/[マストドンアカウント] を作成します。 link:https://joinmastodon.org/servers[サーバーを選択] する必要があります。例えば、 `mastodon.social` 。 アカウントで `Development` オプションを選択し、アプリケーションを登録します。例：

source: Create a https://www.strava.com/settings/api[Strava application]:
ja_jp: https://www.strava.com/settings/api[Strava アプリケーション] を作成します。

source: Create a mail template instance and set the recipient.
ja_jp: メールテンプレートのインスタンスを作成し、受信者を設定します。

source: Create a mailJet account and the API key / Secret Key
ja_jp: MailJetのアカウントとAPIキー/シークレットキーを作成します

source: Create a management endpoint in an extension
ja_jp: エクステンションでのマネジメントエンドポイントの作成

source: Create a method that will handle the HTTP GET request on `/mail`
ja_jp: `/mail` へのHTTP GETリクエストを処理するメソッドを作成

source: Create a native executable using:
ja_jp: 次のようにネイティブ実行可能ファイルの作成します:

source: Create a new Java interface that defines our common character traits.
ja_jp: 私たちの共通のキャラクターの特徴を定義した新しいJavaインタフェースを作成します。

source: Create a new Quinoa project (with a base Quinoa starter code):
ja_jp: 新しいQuinoaプロジェクト（ベースとなるQuinoaスターターコードを含む）を作成します。

source: Create a new `SAML2` integration in your `Okta` `Dashboard/Applications`:
ja_jp: `Okta` の `Dashboard/Applications` に新しい `SAML2` インテグレーションを作成します。

source: Create a new `Task` with the current start time.
ja_jp: 現在の開始時刻で新しい `Task` を作成します。

source: Create a new application from the image source.
ja_jp: イメージソースから新しいアプリケーションを作成します。

source: Create a new class `src/main/java/org/acme/spring/boot/properties/GreetingProperties.java` with a message field:
ja_jp: 次のようにメッセージフィールドを持つ新しいクラス `src/main/java/org/acme/spring/boot/properties/GreetingProperties.java` を作成します:

source: Create a new class named `AppLifecycleBean` (or pick another name) in the `org.acme.lifecycle` package, and copy the following content:
ja_jp: `org.acme.lifecycle` パッケージ内に `AppLifecycleBean` という名前の新しいクラスを作成し(または別の名前を選び)、以下の内容をコピーします。

source: Create a new container image with `-aot` suffix in the version of the image that includes the AOT cache, pre-configured to use it
ja_jp: AOT キャッシュを含み、それを使用するように事前設定された、イメージバージョンに `-aot` サフィックスが付いた新しいコンテナーイメージを作成する

source: Create a new counter called `count.me`
ja_jp: `count.me` という新しいカウンターを作成します。

source: Create a new distribution summary called `response.size`
ja_jp: `response.size` という新しいディストリビューションサマリーを作成します。

source: Create a new folder in your project /src/main/*webapp* which will be the base folder for your React project. Now open another terminal in this folder, run the React project initializer and then add the Patternfly node module:
ja_jp: プロジェクト内に新しいフォルダ/src/main/ *webapp* を作成し、これをReactプロジェクトのベースフォルダとします。このフォルダで別のターミナルを開き、Reactプロジェクトイニシャライザを実行して、Patternfly Nodeモジュールを追加します。

source: Create a new gauge called `jvm.threads.peak` that will call `getPeakThreadCount` on `threadBean`, an instance of `ThreadMXBean`
ja_jp: `jvm.threads.peak` という新しいゲージを作成し、`threadBean` (`ThreadMXBean` のインスタンス) で `getPeakThreadCount` を呼び出します。

source: Create a new gauge, `list.size`, using the dot-separated convention.
ja_jp: ドット区切りの規則を使用して、新しいゲージ `list.size` を作成します。

source: Create a new instance passing in this to scope it to your namespace
ja_jp: 新しいインスタンスを作成し、`this` を渡して名前空間にスコープを設定します

source: Create a new outbound event builder.
ja_jp: 新しい送信イベントビルダーを作成します。

source: Create a new project with the following command:
ja_jp: 以下のコマンドで新規プロジェクトを作成します。

source: Create a new realm or import the existing realm to `Keycloak`. In this case, the realm name has to be `quarkus`.
ja_jp: 新しいレルムを作成するか、既存のレルムを `Keycloak` にインポートします。 この場合、レルム名は `quarkus` にする必要があります。

source: Create a new timer called `my.timer`
ja_jp: `my.timer` という新しいタイマーを作成します。

source: Create a new tutorial that guides users through creating, running, and testing a Quarkus application that uses annotations from an imaginary extension.
ja_jp: 架空のエクステンションからのアノテーションを使用する Quarkus アプリケーションの作成、実行、およびテストをユーザーに説明する新しいチュートリアルを作成します。

source: Create a portable Java API to write serverless functions deployable to AWS Lambda, Azure Functions, Knative, and more.
ja_jp: AWS Lambda、Azure Functions、Knativeなどにデプロイ可能なサーバーレスファンクションを書くためのポータブルなJava APIを作成します。

source: Create a redirection file in Markdown format with a filename that matches the original AsciiDoc source filename that you want to retire.
ja_jp: 破棄したい元のAsciiDocのソースファイル名と一致するファイル名のリダイレクトファイルをMarkdown形式で作成します。

source: Create a resource and obtain a link to it (link:{httpspec}#section-4.3.3[HTTP docs])
ja_jp: リソースを作成し、そのリソースへのリンクを取得します (link:{httpspec}#section-4.3.3[HTTP docs])

source: Create a route handler to support a welcome page at the `http://localhost:8080` address.
ja_jp: `http://localhost:8080` アドレスでウェルカムページをサポートするためのルートハンドラーを作成します。

source: Create a second level heading for the first step
ja_jp: 最初の手順の第 2 レベルの見出しを作成します。

source: Create a separate build step that consumes a `MetricsFactory`, and use the `MetricsFactory::metricsSystemSupported()` method within the bytecode recorder to initialize required resources if the desired metrics API is supported (e.g. "micrometer").
ja_jp: `MetricsFactory` を使用する個別のビルドステップを作成し、バイトコードレコーダー内で `MetricsFactory::metricsSystemSupported()` メソッドを使用して、目的のメトリクス API (例: "micrometer") がサポートされている場合に、必要なリソースを初期化します。

source: Create a separate build step that consumes a `MetricsFactory`, and use the `MetricsFactory::metricsSystemSupported()` method within the bytecode recorder to initialize required resources if the desired metrics API is supported (e.g. "smallrye-metrics" or "micrometer").
ja_jp: `MetricsFactory` を使用する別のビルドステップを作成し、バイトコードレコーダー内の 'MetricsFactory::metricsSystemSupported()' メソッドを使用して、必要なメトリクス API がサポートされている場合に必要なリソースを初期化します (smallrye-metrics や micrometer など)。

source: Create a single PR for related changes to a group of documents; some examples: Correcting the usage of a term, correcting a recurring error, or moving common content into a shared file.
ja_jp: ドキュメントのグループに関連する変更に対して単一の PR を作成します。例: 用語の使用法を修正したり、繰り返し発生するエラーを修正したり、共通のコンテンツを共有ファイルに移動したりします。

source: Create a single PR for related changes to multiple documents, e.g. updates to ensure a term is used consistently, correcting a recurring error, or moving repeated content into a shared file.
ja_jp: たとえば、用語の一貫性を確保するための更新、繰り返されるエラーの修正、繰り返される内容の共有ファイルへの移動など、複数の文書に対する関連する変更について、1 つの PR を作成します。

source: Create a single PR that adds a configuration option for an extension and updates related materials (how-to, reference) to explain the change.
ja_jp: エクステンションの設定オプションを追加し、変更を説明するために関連資料 (ハウツー、リファレンス) を更新する単一の PR を作成します。

source: Create a source code file
ja_jp: ソースコードファイルの作成

source: Create a template instance (`io.quarkus.qute.TemplateInstance`),
ja_jp: テンプレートインスタンスを作成する ( `io.quarkus.qute.TemplateInstance` )

source: Create a timer
ja_jp: タイマーの作成

source: Create a working branch for your project by using your version control system.
ja_jp: バージョン管理システムを使って、プロジェクトの作業ブランチを作成します。

source: Create a wrapped `Callable` for repeated invocation:
ja_jp: 繰り返される呼び出し用にラップされた `Callable` を作成します。

source: Create a wrapped `Runnable` for repeated invocation:
ja_jp: 繰り返される呼び出し用にラップされた `Runnable` を作成します。

source: Create a xref:codestart-yml[codestart.yml] file in `runtime/src/main/codestarts/quarkus/aloha-codestart`:
ja_jp: `runtime/src/main/codestarts/quarkus/aloha-codestart` に xref:codestart-yml[codestart.yml] ファイルを作成します:

source: Create an *Extension Proposal* ticket in the link:https://github.com/quarkusio/quarkus/issues[Quarkus issue tracker] (first check if the extension you're proposing is not created yet) and let us know if you want to lead the development of this extension by commenting on the issue.
ja_jp: https://github.com/quarkusio/quarkus/issues[Quarkusの課題管理]で *エクステンション提案の* チケットを作成し(まず、提案しているエクステンションがまだ作成されていないかどうかを確認してください)、このエクステンションの開発をリードしたい場合は、イシューにコメントをつけてお知らせください。

source: Create an <<integration-test>>.
ja_jp: link:#integration-test[integration-test]を作成

source: Create an Auth0 application
ja_jp: Auth0 アプリケーションの作成

source: Create an Azure Container Registry instance
ja_jp: Azure Container Registry インスタンスの作成

source: Create an Azure Registry Service instance and upload the Docker image
ja_jp: Azure Registry Serviceインスタンスを作成し、Dockerイメージをアップロード

source: Create an ECR repository in the users AWS account
ja_jp: ユーザーの AWS アカウントへの ECR リポジトリーの作成

source: Create an Execution Role
ja_jp: 実行ロールの作成

source: Create an UTF-8 encoded file located in `src/main/resources/messages`; e.g. `msg_de.properties`.
ja_jp: `src/main/resources/messages` に UTF-8 エンコードされたファイルを作成します。例: `msg_de.properties`

source: Create an UTF-8 encoded file located in the `src/main/resources/messages` directory of an application archive; e.g. `msg_de.properties`.
ja_jp: アプリケーションアーカイブの `src/main/resources/messages` ディレクトリーにある UTF-8 エンコードファイルを作成します (例: `msg_de.properties`)。

source: Create an `AtomicBoolean` to track if the batch has been committed.
ja_jp: バッチがコミットされたか追跡するための `AtomicBoolean` を作成します。

source: Create an `admin` role:
ja_jp: `admin` ロールを作成します。

source: Create an anchored ID
ja_jp: アンカー ID の作成

source: Create an application that uses the Micrometer metrics library to collect runtime, extension and application metrics and expose them as a Prometheus (OpenMetrics) endpoint.
ja_jp: Micrometer メトリクスライブラリーを使用して、ランタイム、エクステンション、アプリケーションのメトリクスを収集し、Prometheus (OpenMetrics) エンドポイントとして公開するアプリケーションを作成します。

source: Create an application with the REST extension. You can use the following command to create it:
ja_jp: REST エクステンションを持つアプリケーションを作成します。以下のコマンドで作成できます。

source: Create an application with the `quarkus-funqy-google-cloud-functions` extension. You can use the following Maven command to create it:
ja_jp: `quarkus-funqy-google-cloud-functions` のエクステンションを持つアプリケーションを作成します。 以下の Maven コマンドを使って作成します。

source: Create an application with the `quarkus-google-cloud-functions-http` extension. You can use the following Maven command to create it:
ja_jp: `quarkus-google-cloud-functions-http` のエクステンションを持つアプリケーションを作成します。以下のMavenコマンドで作成することができます:

source: Create an application with the `quarkus-google-cloud-functions` extension. You can use the following Maven command to create it:
ja_jp: `quarkus-google-cloud-functions` のエクステンションを持つアプリケーションを作成します。以下のMavenコマンドを使って作成します。

source: Create an application with the `quarkus-logging-gelf` extension. You can use the following command to create it:
ja_jp: `quarkus-logging-gelf` のエクステンションを持つアプリケーションを作成します。以下のコマンドで作成することができます:

source: Create an initial configuration if no configuration already exists.
ja_jp: 設定がまだ存在しない場合は、初期設定を作成します。

source: Create an instance of Hibernate Search's mass indexer, which allows indexing a lot of data efficiently (you can fine tune it for better performance).
ja_jp: Hibernate Search の大量インデクサーのインスタンスを作成します。これにより、大量のデータを効率的にインデックス化できます (パフォーマンスを向上させるために微調整できます)。

source: Create an interface that extends the default interface that is annotated with `@Localized`
ja_jp: `@Localized` でアノテーションされたデフォルトのインターフェイスを拡張するインターフェイスを作成します。

source: Create and debug applications in the same environment where applications run. Live coding in development mode where any changes made locally will be immediately visible in a clustered Kubernetes environment.
ja_jp: アプリケーションが実行されるのと同じ環境で、アプリケーションを作成しデバッグします。開発モードでのライブコーディングでは、ローカルで行われた変更はクラスター化されたKubernetes環境に即座に反映されます。

source: Create and verify the Maven project
ja_jp: Maven プロジェクトの作成および検証

source: Create consumer task which subscribes to 'orders-processed' topic and consumes 10 records.
ja_jp: 'orders-processed' トピックをサブスクライブし、10 のレコードを消費するコンシューマータスクを作成します。

source: Create inside the `producer` project `src/main/resources/META-INF/resources/quotes.html` file, with the following content:
ja_jp: `producer` プロジェクト内に、次の内容で `src/main/resources/META-INF/resources/quotes.html` ファイルを作成します。

source: Create mapping step for the `SomeIndexedEntity` entity.
ja_jp: `SomeIndexedEntity` エンティティーのマッピングステップを作成します。

source: Create mapping step for the `SomeIndexedEntity` type.
ja_jp: `SomeIndexedEntity` タイプのマッピングステップを作成します。

source: Create multiple verticles instances
ja_jp: 複数のvirticleのインスタンスの作成

source: Create new Quarkus Core extension modules using Maven
ja_jp: Maven を使用した新しい Quarkus Core 拡張モジュールの作成

source: Create new documentation files using the appropriate template for the content type:
ja_jp: コンテンツタイプに適したテンプレートを使用して、新しいドキュメントファイルを作成します。

source: Create new documentation files with the appropriate template for the content type:
ja_jp: コンテンツタイプに適したテンプレートで、新しいドキュメントファイルを作成してください:

source: Create permission checkers
ja_jp: 権限チェッカーを作成する

source: Create permission meta-annotations
ja_jp: 権限メタアノテーションを作成する

source: Create projects, manage extensions, and execute essential build and dev commands.
ja_jp: プロジェクトを作成し、エクステンションを管理し、必要なビルドや開発コマンドを実行します。

source: Create reliable, secure AI applications using Quarkus’s built-in observability, security, and governance—ensuring AI services are safe, accountable, and performance-ready from the beginning.
ja_jp: Quarkusの組み込みの可観測性、セキュリティ、ガバナンスを活用して、信頼性と安全性の高いAIアプリケーションを構築します。これにより、AIサービスが最初から安全で、説明責任を果たし、パフォーマンスに対応できるようにします。

source: Create the AWS lambda function with the AWS CLI tool
ja_jp: AWS CLI ツールを使用した AWS ラムダ関数の作成

source: Create the Azure Maven project for your Quarkus application using our Maven Archetype.
ja_jp: Maven Archetypeを使用して、Quarkusアプリケーション用の Azure mavenプロジェクトを作成します。

source: Create the Getting Started Application
ja_jp: 入門アプリケーションの作成
